{
  "In Your name, O Allah, I die and I live.": "Senin isminle Allah'ım ölürüm ve yaşarım.",
  "All praise is for Allah who gives us life after He has caused us to die, and to Him is the resurrection.": "Hamd, bizi öldürdükten sonra dirilten Allah'a mahsustur ve diriliş O'nadır.",
  "O Allah, I seek refuge in You from the evil and the wicked.": "Allah'ım şerrden ve kötülerden sana sığınırım.",
  "I ask for Your forgiveness (O Allah).": "Senden mağfiret dilerim (Allah'ım).",
  "In the name of Allah.": "Allah'ın adıyla.",
  "In the name of Allah, at its beginning and its end.": "Başında ve sonunda Allah'ın adıyla.",
  "All praise is to Allah who has fed me this and provided for me without any power or strength from me.": "Bütün hamdler, benden hiçbir güç ve kuvvet olmaksızın bana bunu yediren ve bana rızık veren Allah'a mahsustur.",
  "O Allah, open the doors of Your mercy for me.": "Allahım bana rahmetinin kapılarını aç.",
  "O Allah, I ask You for Your bounty.": "Allah'ım senden lütfunu isterim.",
  "I bear witness that there is no deity except Allah alone, with no partner, and I bear witness that Muhammad is His servant and Messenger. O Allah, make me among those who repent and make me among those who purify themselves. Glory be to You, O Allah, and with Your praise, I bear witness that there is no deity except You. I seek Your forgiveness and repent to You.": "Tek ve ortağı olmayan Allah'tan başka ilah olmadığına ve Muhammed'in O'nun kulu ve elçisi olduğuna şahitlik ederim. Allah'ım beni tevbe edenlerden eyle ve temizlenenlerden eyle. Seni tesbih ederim Allah'ım, hamdınla şehadet ederim ki Senden başka ilah yoktur. Senden bağışlanma diler ve sana tövbe ederim.",
  "The thirst has gone, the veins are moistened, and the reward is confirmed, Insha Allah.": "Susuzluk gitti, damarlar nemlendi, sevap kesinleşti inşaAllah.",
  "Peace be upon you.": "Selam üzerinize olsun.",
  "Peace, mercy, and blessings of Allah be upon you.": "Allah'ın selamı, rahmeti ve bereketi üzerinize olsun.",
  "In the name of Allah, I place my trust in Allah. There is no might nor power except with Allah.": "Allah'ın adıyla Allah'a tevekkül ediyorum. Allah'tan başka güç ve kuvvet yoktur.",
  "O Allah, I seek refuge in You lest I should stray or be led astray, slip or be tripped, wrong or be wronged, or act foolishly or have foolishness done to me.": "Allah'ım, sapmaktan, saptırılmaktan, kaymaktan, takılıp düşmekten, haksızlığa uğramaktan, haksızlığa uğramaktan, ahmaklık yapmaktan veya bana akılsızlığa uğramaktan sana sığınırım.",
  "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. Glory be to Him who has provided this for us, though we could never have had it by our own efforts. Surely to our Lord we are returning. O Allah, we ask You for righteousness and piety in this journey of ours, and for deeds that please You. O Allah, lighten for us the hardship of this journey and quickly bring us to our destination. O Allah, You are our Companion on the journey and the Guardian of our families. O Allah, I seek refuge in You from the hardship of travel, from a bad return, and from seeing something unpleasant concerning our wealth, family, or children.": "Allah en büyüktür, Allah en büyüktür, Allah en büyüktür. Kendi çabalarımızla asla elde edemeyeceğimiz halde, bunu bize sağlayan Allah'a hamd olsun. Şüphesiz biz Rabbimize dönüyoruz. Allah'ım, bu yolculuğumuzda Senden iyilik, takva ve razı olacağın amel dileriz. Allah'ım bu yolculuğun sıkıntısını üzerimizden hafiflet ve bizi gideceğimiz yere çabuk ulaştır. Allah'ım, sen bizim yol arkadaşımız ve ailemizin koruyucususun. Allah'ım, yolculuğun zorluğundan, kötü dönüşten, mallarımız, ailemiz ve çocuklarımızla ilgili hoş olmayan bir şey görmekten sana sığınırım.",
  "I entrust your religion, your trust, and the end of your deeds to Allah.": "Dininizi, emanetinizi ve amellerinizin sonunu Allah'a emanet ediyorum.",
  "May Allah provide you with piety, forgive your sins, and ease goodness for you wherever you are.": "Allah sana takvayı versin, günahlarını bağışlasın ve nerede olursan ol sana iyilik kolaylaştırsın.",
  "O Allah, to You is all praise. You have clothed me with this. I ask You for its goodness and the goodness for which it was made, and I seek refuge in You from its evil and the evil for which it was made.": "Allah'ım, hamd sana mahsustur. Bunu bana sen giydirdin. Senden onun hayrını ve ne için yaratıldığının hayırlarını isterim, onun şerrinden ve ne için yaratıldığı şerrinden de sana sığınırım.",
  "Praise be to Allah who has clothed me with this garment and provided it for me without any power or strength from me.": "Bu elbiseyi bana giydiren ve benden hiçbir güç ve kuvvet olmaksızın onu bana rızık kılan Allah'a hamd olsun.",
  "In the name of Allah, in the name of Allah, in the name of Allah. All praise is to Allah. Glory be to Him who has subjected this to us, and we could not have done so by ourselves. And indeed, to our Lord we will return. Glory be to You, indeed I have wronged myself, so forgive me, for none can forgive sins except You.": "Allah'ın adıyla, Allah'ın adıyla, Allah'ın adıyla. Bütün övgüler Allah'a mahsustur. Bunu bize nasip eden Allah'a hamdolsun, biz bunu kendi başımıza yapamazdık. Ve şüphesiz biz Rabbimize döneceğiz. Seni tenzih ederim, gerçekten ben kendime zulmettim, beni bağışla, çünkü günahları Senden başkası bağışlayamaz.",
  "O Allah, make it a beneficial rain.": "Allah'ım, onu faydalı bir yağmur eyle.",
  "O Allah, (let the rain fall) around us, not on us. O Allah, (let it fall) on the hills, mountains, small mountains, valleys, and places where trees grow.": "Allah'ım, (yağmur) etrafımıza yağsın, üzerimize değil. Allah'ım, tepelere, dağlara, küçük dağlara, vadilere, ağaçların yetiştiği yerlere (düştür.)",
  "We have been given rain by the bounty and mercy of Allah.": "Allah'ın lütfu ve rahmeti sayesinde bize yağmur verildi.",
  "O Allah, I ask You for the good of this wind, and I seek refuge in You from its evil.": "Allah'ım, Senden bu rüzgârın hayrını isterim, şerrinden de Sana sığınırım.",
  "O Allah, You are my Lord. There is no deity worthy of worship except You. You created me, and I am Your servant. I abide to Your covenant and promise as best I can. I seek refuge in You from the evil of what I have done. I acknowledge Your blessings upon me, and I acknowledge my sin. So forgive me, for none can forgive sins except You.": "Allah'ım sen benim Rabbimsin. Senden başka ibadete layık ilah yoktur. Beni sen yarattın, ben de senin kulunum. Gücüm yettiğince ahdine ve vaadine uyuyorum. Yaptığım şeylerin şerrinden sana sığınırım. Üzerimdeki nimetini ikrar ediyorum, günahımı da ikrar ediyorum. O halde beni bağışla, çünkü günahları Senden başkası bağışlayamaz.",
  "O Allah, there is no ease except in that which You make easy, and You make the difficult easy if You wish.": "Allah'ım senin kolaylaştırdığından başka kolaylık yoktur, sen dilersen zoru da kolaylaştırırsın.",
  "Indeed we belong to Allah, and indeed to Him we will return. O Allah, reward me for my affliction and replace it with something better.": "Şüphesiz biz Allah'ız ve şüphesiz O'na döneceğiz. Allah'ım, bu musibetten dolayı beni mükafatlandır ve onun yerine daha hayırlısını ver.",
  "O Allah, suffice me with what is lawful and keep me away from what is unlawful, and enrich me with Your bounty so I do not depend on anyone besides You.": "Allah'ım, beni helâl ile yetin, beni haramdan uzak tut ve lütfunla beni zenginleştir ki, senden başkasına muhtaç olmayayım.",
  "O Allah, I seek refuge in You from anxiety and grief, and I seek refuge in You from incapacity and laziness, and I seek refuge in You from cowardice and miserliness, and I seek refuge in You from being overpowered by debt and from being overcome by men.": "Allah'ım, kaygı ve kederden sana sığınırım, acizlik ve tembellikten sana sığınırım, korkaklık ve cimrilikten sana sığınırım, borç altında ezilmekten ve insanların galip gelmesinden sana sığınırım.",
  "All praise is to Allah.": "Bütün övgüler Allah'a mahsustur.",
  "May Allah have mercy on you.": "Allah sana rahmet etsin.",
  "May Allah guide you and improve your condition.": "Allah size yol göstersin ve durumunuzu iyileştirsin.",
  "O Allah, just as You have made my external form good, make my character good as well.": "Allah'ım, dış görünüşümü güzel kıldığın gibi, ahlâkımı da güzel kıl.",
  "My Lord, I seek refuge in You from the whispers of Satan, and I seek refuge in You, my Lord, from their presence around me.": "Rabbim, şeytanın vesveselerinden sana sığınırım, onların etrafımda bulunmasından da sana sığınırım Rabbim.",
  "O Allah, Lord of this perfect call and the established prayer, grant Muhammad the wasilah (a high status in Paradise) and the excellence (above all creation), and raise him to the praiseworthy station that You have promised him.": "Ey bu mükemmel davetin ve kılınan namazın Rabbi olan Allah'ım, Muhammed'e vesîle (Cennette yüksek bir makam) ve üstünlük (yaratılmışların üstünde) ver ve onu, kendisine vaad ettiğin övgüye değer makama yükselt.",
  "Our Lord, forgive me and my parents and all the believers on the Day the account is established.": "Rabbimiz, hesap görülecek günde beni, ana-babamı ve bütün mü'minleri bağışla.",
  "Our Lord! Give us good in this world and give us good in the Hereafter, and save us from the torment of the hell fire.": "Rabbimiz! Bize dünyada iyilik ver, ahirette de iyilik ver ve bizi cehennem ateşi azabından koru.",
  "O Changer of the hearts, make my heart firm upon Your religion.": "Ey kalpleri değiştiren, kalbimi dinin üzere sabit kıl.",
  "O Allah! Controller of the hearts, direct our hearts to Your obedience.": "Allah'ım! Kalpleri idare eden, kalplerimizi Senin itaatine yönelt.",
  "O our Lord, do not make our hearts incline to error after You have guided us.": "Ey Rabbimiz, bizi doğru yola ilettikten sonra kalplerimizi sapıklığa meyletme.",
  "O Allah, I seek refuge in You from the loss of the pleasures that You have bestowed, from changes in the health that You have bestowed, from Your sudden torment, and from all Your wrath.": "Allah'ım, verdiğin nimetlerin kaybolmasından, verdiğin afiyetin değişmesinden, ani azabından ve her türlü gazabından sana sığınırım.",
  "O Allah, I seek refuge in You from severe calamity, being overtaken by misery, evil destiny, and the triumphant mockery of enemies.": "Allah'ım, şiddetli musibetlerden, bedbahtlıktan, kötü kaderden, düşmanların alay konusu olmasından sana sığınırım.",
  "O Allah, I seek refuge in You from care and grief, I seek refuge in You from incapacity and slackness, I seek refuge in You from cowardice and niggardliness, and I seek refuge in You from being overcome by debt and being put in subjection by men.": "Allah'ım, tasa ve kederden sana sığınırım, acizlik ve gevşeklikten sana sığınırım, korkaklık ve cimrilikten sana sığınırım, borca ​​girmekten ve insanların boyunduruğu altına girmekten sana sığınırım.",
  "Praise be to Allah, by whose grace goodness is perfected.": "Lütfuyla iyiliği tamamlayan Allah'a hamd olsun.",
  "I seek forgiveness from Allah.": "Allah'tan mağfiret dilerim.",
  "O Allah, You are Peace, and from You is peace. Blessed are You, O Possessor of majesty and honor.": "Allah'ım, sen selamsın, selam sendendir. Ne mutlu sana, ey azamet ve şeref sahibi.",
  "There is no deity worthy of worship except Allah alone, He has no partner. To Him belongs dominion and praise, and He is over all things competent. O Allah, there is no preventer of what You give, and no giver of what You withhold, and wealth and honor do not benefit their possessor (except faith and righteous deeds that save from punishment). Only from You is wealth and honor.": "Tek olan Allah'tan başka ibadete layık ilah yoktur, O'nun ortağı yoktur. Mülk ve hamd O'nundur ve O, her şeye kadirdir. Allah'ım, senin verdiğine engel olan, vermediğini veren yoktur; mal ve şeref, (iman ve azaptan kurtaran salih amel hariç) sahibine fayda sağlamaz. Zenginlik ve şeref ancak Sendendir.",
  "There is no deity worthy of worship except Allah alone, He has no partner. To Him belongs dominion and praise, and He is over all things competent. There is no power and no strength except by Allah. There is no deity worthy of worship except Allah, and we do not worship except Him. To Him belongs all favor, grace, and good praise. There is no deity worthy of worship except Allah, making our religion sincerely for Him, even if the disbelievers dislike it.": "Tek olan Allah'tan başka ibadete layık ilah yoktur, O'nun ortağı yoktur. Mülk ve hamd O'nundur ve O, her şeye kadirdir. Allah'tan başka güç ve kuvvet yoktur. Allah'tan başka ibadete layık ilah yoktur ve biz O'ndan başkasına ibadet etmeyiz. Bütün iyilikler, lütuflar ve güzel övgüler O'na aittir. Kâfirler hoşlanmasa da dinimizi O'na halis kılan Allah'tan başka ibadete layık ilah yoktur."
}
